using System.ComponentModel.DataAnnotations;

namespace Ask.Core.Shared.Entity.Settings
{
  public class SettingsProtocolModel
  {
    [Key]
    public int Id { get; set; } = 1;

    /// <summary>
    /// Отображение данных об устройстве в протоколе.
    /// </summary>
    public bool ShowDeviceInfo { get; set; }

    /// <summary>
    /// Отображение заголовков при выполнении.
    /// </summary>
    public bool ShowHeaderInfo { get; set; }

    /// <summary>
    /// Флаг, указывающий, нужно ли сохранять протокол.
    /// </summary>
    public bool AutoSaveProtocol { get; set; }

    /// <summary>
    /// Флаг, указывающий, нужно ли печатать протокол.
    /// </summary>
    public bool AutoPrintProtocol { get; set; }

    /// <summary>
    /// Флаг, указывающий время выполнения операций.
    /// </summary>
    public bool DisplayOperationTime { get; set; }

    /// <summary>
    /// Флаг, указывающий на подробное отображение протокола.
    /// </summary>
    public bool ShowDetailedProtocol { get; set; }

    /// <summary>
    /// Флаг указывающий на вывод протокола в ПО.
    /// </summary>
    public bool ShowProtocolInSoftware { get; set; }

    /// <summary>
    /// Флаг, указывающий, нужно ли формировать протокол.
    /// </summary>
    public bool GenerateProtocol { get; set; }

    /// <summary>
    /// Базовый текст протокола (без ошибок).
    /// </summary>
    public string CleanTextProtocol { get; set; } =
@"Протокол($РЕЖИМ) от $ДАТА
проверки электрических параметров сборочной единицы $ОБОЗНАЧЕНИЕ Зав.N $НОМЕР
Цель проверки: проверка электрических параметров сборочной единицы на соответствие техническим условиям
Оборудование: установка контроля электромонтажа АСК-МКИ-М
Программа проверки: $ПРОГРАММА
  Начало проверки: $НАЧАЛО
  Завершение проверки: $КОНЕЦ
  Время выполнения: $ВРЕМЯ

Обрывов: не обнаружено
Замыканий: не обнаружено
Нарушений изоляции: не обнаружено

Заключение: Изделие $ОБОЗНАЧЕНИЕ Зав.N $НОМЕР
            соответствует требованиям КД

Исполнитель: ________________ / $ИСПОЛНИТЕЛЬ

Представитель ОК: ________________ / $ПРЕДСТАВИТЕЛЬ

Представитель заказчика (ВП): ________________ / $ЗАКАЗЧИК";


    /// <summary>
    /// Базовый текст протокола (с ошибками).
    /// </summary>
    public string CleanTextErrorsProtocol { get; set; } =
@"Протокол($РЕЖИМ) от $ДАТА
проверки электрических параметров сборочной единицы $ОБОЗНАЧЕНИЕ Зав.N $НОМЕР
Программа проверки: $ПРОГРАММА

Заключение: Изделие $ОБОЗНАЧЕНИЕ $НАИМЕНОВАНИЕ
            Зав.N $НОМЕР $БРАК(не )соответствует требованиям КД

Исполнитель: ________________ / $ИСПОЛНИТЕЛЬ

Представитель ОТК: ________________ / $ПРЕДСТАВИТЕЛЬ

Представитель заказчика (ВП): ________________ / $ЗАКАЗЧИК";


    /// <summary>
    /// Базовый текст протокола (с ошибками).
    /// </summary>
    public string ErrorTextProtocol { get; set; } = string.Empty;
  }
}
