namespace Ask.Core.Shared.Metadata.Enums.TranslationEnums
{
  /// <summary>
  /// Ключи алгоритмов, используемые при выполнении и интерпретации программ.
  /// Представляют собой краткие идентификаторы алгоритмических операций
  /// и шагов, применяемых в системе.
  /// </summary>
  public enum AlgorithmKey
  {
    /// <summary>
    /// Алгоритмический ключ «ЗР».
    /// </summary>
    ЗР,

    /// <summary>
    /// Алгоритмический ключ «ЗС».
    /// </summary>
    ЗС,

    /// <summary>
    /// Алгоритмический ключ «П».
    /// </summary>
    П,

    /// <summary>
    /// Алгоритмический ключ «И».
    /// </summary>
    И,

    /// <summary>
    /// Алгоритмический ключ «Г».
    /// </summary>
    Г,

    /// <summary>
    /// Алгоритмический ключ «С».
    /// </summary>
    С,

    /// <summary>
    /// Алгоритмический ключ «Т1».
    /// </summary>
    Т1,

    /// <summary>
    /// Алгоритмический ключ «Ш».
    /// </summary>
    Ш,

    /// <summary>
    /// Алгоритмический ключ «Т».
    /// </summary>
    Т,

    /// <summary>
    /// Алгоритмический ключ «Б».
    /// </summary>
    Б,

    /// <summary>
    /// Алгоритмический ключ «К».
    /// </summary>
    К,

    /// <summary>
    /// Алгоритмический ключ «Н».
    /// </summary>
    Н,

    /// <summary>
    /// Алгоритмический ключ «Д».
    /// </summary>
    Д
  }

}
